tillitis/tillitis-key1/hw/usb_interface/ch552_fw/main.c
XDATA uint8_t CdcRxBuf[MAX_CDC_FRAME_SIZE] = { 0 };
IDATA uint8_t CdcRxBufLength = 0;
IDATA uint8_t CdcDataAvailable = 0;
IDATA uint32_t CdcLoopCount = 0;

XDATA uint8_t HidRxBuf[HID_FRAME_SIZE] = { 0 };
IDATA uint8_t HidRxBufLength;
IDATA uint8_t HidDataAvailable;

/** Frame data */
#define FRAME_TIMEOUT   10000  // Timeout in number of main loop iterations

#define MODE_CDC        0x40
#define MODE_HID        0x80
#define MODE_MASK       0xC0
#define NUM_MASK        0x3F

volatile IDATA uint8_t FrameMode   = 0;
volatile IDATA uint8_t FrameLength = 0;
volatile IDATA uint8_t FrameStarted = 0;
volatile IDATA uint8_t Halted = 0;

/*******************************************************************************
 * Function Name  : USBDeviceCfg()
 * Description    : USB device mode configuration
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void USBDeviceCfg()
{
    USB_CTRL = 0x00;                                       // Clear USB control register
    USB_CTRL &= ~bUC_HOST_MODE;                            // This bit selects the device mode
    USB_CTRL |= bUC_DEV_PU_EN | bUC_INT_BUSY | bUC_DMA_EN; // USB device and internal pull-up enable, automatically return to NAK before interrupt flag is cleared
    USB_DEV_AD = 0x00;                                     // Device address initialization
#if 0
    // USB_CTRL |= bUC_LOW_SPEED;
    // UDEV_CTRL |= bUD_LOW_SPEED;                         // Select low speed 1.5M mode
#else
    USB_CTRL &= ~bUC_LOW_SPEED;
    UDEV_CTRL &= ~bUD_LOW_SPEED;                           // Select full speed 12M mode, the default mode
#endif
    UDEV_CTRL = bUD_PD_DIS;                                // Disable DP / DM pull-down resistor
    UDEV_CTRL |= bUD_PORT_EN;                              // Enable physical port
}

/*******************************************************************************
 * Function Name  : USBDeviceIntCfg()
 * Description    : USB device mode interrupt initialization
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void USBDeviceIntCfg()
{
    USB_INT_EN |= bUIE_SUSPEND;  // Enable device suspend interrupt
    USB_INT_EN |= bUIE_TRANSFER; // Enable USB transfer completion interrupt
    USB_INT_EN |= bUIE_BUS_RST;  // Enable device mode USB bus reset interrupt
    USB_INT_FG |= (UIF_FIFO_OV | UIF_HST_SOF | UIF_SUSPEND | UIF_TRANSFER | UIF_BUS_RST ); // Clear interrupt flag
    IE_USB = 1;                  // Enable USB interrupt
    EA = 1;                      // Allow microcontroller interrupt
}

/*******************************************************************************
 * Function Name  : USBDeviceEndPointCfg()
 * Description    : USB device mode endpoint configuration, simulation compatible
 *                  HID device, in addition to endpoint 0 control transmission,
 *                  also includes endpoint 2 batch upload
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void USBDeviceEndPointCfg()
{
    // TODO: Is casting the right thing here? What about endianness?
    UEP0_DMA = (uint16_t) Ep0Buffer; // Endpoint 0 data transfer address
    UEP1_DMA = (uint16_t) Ep1Buffer; // Endpoint 1 sends data transfer address
    UEP2_DMA = (uint16_t) Ep2Buffer; // Endpoint 2 IN data transfer address
    UEP3_DMA = (uint16_t) Ep3Buffer; // Endpoint 3 IN data transfer address

    UEP4_1_MOD = bUEP1_TX_EN;                                           // Endpoint 1, transmit enable; Endpoint 0 single 8-byte send and receive buffer
    UEP2_3_MOD = bUEP2_TX_EN | bUEP2_RX_EN | bUEP3_TX_EN | bUEP3_RX_EN; // Endpoint 2/3, single buffer, transmit+receive enable

    UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;                 // Manual flip, OUT transaction returns ACK, IN transaction returns NAK
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;                 // Endpoint 1 automatically flips the synchronization flag, IN transaction returns NAK
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK; // Endpoint 2 automatically flips the synchronization flag, IN transaction returns NAK, OUT returns ACK
    UEP3_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK; // Endpoint 3 automatically flips the synchronization flag, IN transaction returns NAK, OUT returns ACK

}

/*******************************************************************************
 * Function Name  : Config_Uart1(uint8_t *cfg_uart)
 * Description    : Configure serial port 1 parameters
 * Input          : Serial port configuration parameters Four bit baud rate, stop bit, parity, data bit
 * Output         : None
 * Return         : None
 *******************************************************************************/
void Config_Uart1(uint8_t *cfg_uart)
{
    uint32_t uart1_buad = 0;
    *((uint8_t*) &uart1_buad) = cfg_uart[0];
    *((uint8_t*) &uart1_buad + 1) = cfg_uart[1];
    *((uint8_t*) &uart1_buad + 2) = cfg_uart[2];
    *((uint8_t*) &uart1_buad + 3) = cfg_uart[3];
    SBAUD1 = 256 - FREQ_SYS / 16 / uart1_buad;   // SBAUD1 = 256 - Fsys / 16 / baud rate
    IE_UART1 = 1; // Enable UART1 interrupt
}

void usb_irq_setup_handler(void)
{
    uint16_t len = USB_RX_LEN;
    printStrSetup("Setup ");

    if (len == (sizeof(USB_SETUP_REQ))) {
        SetupLen = ((uint16_t) UsbSetupBuf->wLengthH << 8) | (UsbSetupBuf->wLengthL);
        len = 0; // Defaults to success and uploading 0 length
        SetupReq = UsbSetupBuf->bRequest;

        // Class-Specific Requests, i.e. HID request, CDC request etc.
        if ((UsbSetupBuf->bmRequestType & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD) {
            printStrSetup("Class-Specific ");
            printStrSetup("SetupReq=");
            printStrSetup("0x");
            printNumHexSetup(SetupReq);
            printStrSetup(" ");
            switch(SetupReq) {
            case USB_HID_REQ_TYPE_GET_REPORT:
                printStrSetup("HID Get Report\n");
                break;
            case USB_HID_REQ_TYPE_GET_IDLE:
                printStrSetup("HID Get Idle\n");
                break;
            case USB_HID_REQ_TYPE_GET_PROTOCOL:
                printStrSetup("HID Get Protocol\n");
                break;
            case USB_HID_REQ_TYPE_SET_REPORT:
                printStrSetup("HID Set Report\n");
                break;
            case USB_HID_REQ_TYPE_SET_IDLE:
                printStrSetup("HID Set Idle\n");
                break;
            case USB_HID_REQ_TYPE_SET_PROTOCOL:
                printStrSetup("HID Set Protocol\n");
                break;
            case USB_CDC_REQ_TYPE_SET_LINE_CODING:
                printStrSetup("CDC Set Line Coding\n");
                break;
            case USB_CDC_REQ_TYPE_GET_LINE_CODING:
                printStrSetup("CDC Get Line Coding\n");
                pDescr = LineCoding;
                len = sizeof(LineCoding);
                len = SetupLen >= DEFAULT_EP0_SIZE ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                memcpy(Ep0Buffer, pDescr, len);
                SetupLen -= len;
                pDescr += len;
                break;
            case USB_CDC_REQ_TYPE_SET_CONTROL_LINE_STATE: // Generates RS-232/V.24 style control signals
                printStrSetup("CDC Set Control Line State\n");
                break;
            default:
                len = 0xFF; // Command not supported
                printStrSetup("Unsupported\n");
                break;
            }
        } // END Non-standard request

        else { // Standard Requests
            // Request code
            switch (SetupReq) {
            case USB_GET_DESCRIPTOR: {
                switch (UsbSetupBuf->wValueH) {
                case USB_DESC_TYPE_DEVICE: // Device descriptor
                    pDescr = DevDesc; // Send the device descriptor to the buffer to be sent
                    len = sizeof(DevDesc);
                    printStrSetup("DevDesc\n");
                    break;
                case USB_DESC_TYPE_CONFIGURATION: // Configuration descriptor
                    pDescr = CfgDesc; // Send the configuration descriptor to the buffer to be sent
                    len = sizeof(CfgDesc);
                    printStrSetup("CfgDesc\n");
                    break;
                case USB_DESC_TYPE_STRING: // String descriptors
                    if (UsbSetupBuf->wValueL == USB_IDX_LANGID_STR) {
                        pDescr = LangDesc;
                        len = sizeof(LangDesc);
                        printStrSetup("LangDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_MFC_STR) {
                        pDescr = ManufDesc;
                        len = sizeof(ManufDesc);
                        printStrSetup("ManufDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_PRODUCT_STR) {
                        pDescr = ProdDesc;
                        len = sizeof(ProdDesc);
                        printStrSetup("ProdDesc\n");
                    } else if (UsbSetupBuf->wValueL == USB_IDX_SERIAL_STR) {
                        pDescr = SerialDesc;
                        len = sizeof(SerialDesc);
                        printStrSetup("SerialDesc\n");
                    } else {
                        printStrSetup("Error: USB_DESC_TYPE_STRING\n");
                    }
                    break;
                case USB_DESC_TYPE_HID:
                    pDescr = HID_CfgDesc;
                    len = sizeof(HID_CfgDesc);
                    printStrSetup("HID_CfgDesc\n");
                    break;
                case USB_DESC_TYPE_REPORT:
                    pDescr = HID_ReportDesc;
                    len = sizeof(HID_ReportDesc);
                    printStrSetup("HID_ReportDesc\n");
                    break;
                default:
                    len = 0xFF; // Unsupported command or error
                    printStrSetup("Unsupported\n");
                    break;
                }

