tillitis/tillitis-key1/hw/usb_interface/ch552_fw/main.c
            // Check if Endpoint 3 (HID) has received data
            if (UsbEp3ByteCount) {
                byte_len = UsbEp3ByteCount;
                memcpy(UartTxBuf, Ep3Buffer, byte_len);

                UsbEp3ByteCount = 0;
                CH554UART1SendByte(MODE_HID); // Send HID mode header
                CH554UART1SendByte(byte_len); // Send length (always 64 bytes)
                CH554UART1SendBuffer(UartTxBuf, byte_len);
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 3 to ACK again
            }

            UartRxBufByteCount = uart_byte_count();               // Check amount of data in buffer

            if ((UartRxBufByteCount >= 2) && !FrameStarted) {            // If we have data and the header in not yet validated
                FrameMode = UartRxBuf[UartRxBufOutputPointer];           // Extract frame mode
                if ((FrameMode == MODE_CDC) ||
                    (FrameMode == MODE_HID)) {
                    FrameLength = UartRxBuf[UartRxBufOutputPointer + 1]; // Extract frame length
                    FrameStarted = 1;
                } else {                                                 // Invalid mode
                    if (!Halted) {
                        printStr("Invalid header: 0x");
                        printNumHex(FrameMode);
                        printStr(", len = ");
                        printNumU32(UartRxBuf[UartRxBufOutputPointer + 1]);
                        printStr("\n");
                        uint16_t i;
                        uint8_t print_char_count_out = 0;
                        for (i=0; i<UART_RX_BUF_SIZE; i++) {
                            printNumHex(UartRxBuf[(UartRxBufOutputPointer + i) % UART_RX_BUF_SIZE]);
                            print_char_count_out++;
                            if (print_char_count_out >= 16) {
                                printStr("\n");
                                print_char_count_out = 0;
                            }
                        }
                        if (print_char_count_out != 0) {
                            printStr("\n");
                        }
                        printStr("Halting!\n");
                        Halted = 1;
                    }
                }
            }

            if (FrameStarted && (LoopCounter - LastReceiveCounter > FRAME_TIMEOUT)) {
                // Timeout, reset frame reception
                FrameMode = 0;
                FrameLength = 0;
                FrameStarted = 0;
                printStr("Frame timeout, reset\n");
                if (FrameMode == MODE_CDC) {
                    CdcRxBufLength = 0;
                    CdcLoopCount = 0;
                }
            }

            if (FrameStarted) {
                // Check if a complete frame has been received, include one mode byte and and one length byte
                if (UartRxBufByteCount >= (FrameLength + 2)) {
                    UartRxBufOutputPointer+=2; // Start at valid data so skip the mode and length byte
                    if (FrameMode == MODE_CDC) {
                        circular_copy(CdcRxBuf + CdcRxBufLength,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameLength);
                        CdcRxBufLength += FrameLength;
                        CdcDataAvailable = 1;
                    } else if (FrameMode == MODE_HID) {
                        circular_copy(HidRxBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameLength);
                        HidRxBufLength = MAX_PACKET_SIZE;
                        HidDataAvailable = 1;
                    }
                    // Update output pointer
                    UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer, FrameLength, UART_RX_BUF_SIZE);

                    // Get next header and data
                    FrameStarted = 0;
                }
            }

            // Check if we should upload data to Endpoint 2 (CDC)
            if (CdcDataAvailable && !Endpoint2UploadBusy && ((CdcLoopCount >= 100) || CdcRxBufLength >= MAX_CDC_FRAME_SIZE)) {

                // Write upload endpoint
                memcpy(Ep2Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 2 */
                       CdcRxBuf,
                       CdcRxBufLength);

                UEP2_T_LEN = CdcRxBufLength; // Set the number of data bytes that Endpoint 2 is ready to send
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK
                Endpoint2UploadBusy = 1; // Set busy flag
                CdcDataAvailable = 0;
                CdcRxBufLength = 0;
                CdcLoopCount = 0;
            } else {
                CdcLoopCount++;
            }

            // Check if we should upload data to Endpoint 3 (HID)
            if (HidDataAvailable && !Endpoint3UploadBusy) {

                // Write upload endpoint
                memcpy(Ep3Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 3 */
                       HidRxBuf,
                       HidRxBufLength);

                UEP3_T_LEN = MAX_PACKET_SIZE; // Set the number of data bytes that Endpoint 3 is ready to send
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK
                Endpoint3UploadBusy = 1; // Set busy flag
                HidDataAvailable = 0;
            }

#if 1
            DebugUartRxBufByteCount = debug_uart_byte_count();
            if (DebugUartRxBufByteCount) {
                switch(DebugUartRxBuf[DebugUartRxBufOutputPointer]) {
                case 'h':
                    printStr("h          Show help\n");
                    printStr("r          Reset UART1\n");
                    printStr("s          Show status\n");
                    break;

                case 'r':
                    /** UART */
                    UartRxBufInputPointer = 0;
                    UartRxBufOutputPointer = 0;
                    UartRxBufOverflow = 0;
                    /** Frame */
                    FrameMode = 0;
                    FrameLength = 0;
                    FrameStarted = 0;
                    /** CDC */
                    CdcDataAvailable = 0;
                    CdcRxBufLength = 0;
                    CdcLoopCount = 0;
                    /** HID */
                    HidDataAvailable = 0;
                    /** Timeout */
                    LoopCounter = 0;
                    LastReceiveCounter = 0;
                    /** Endpoints */
                    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
                    UEP3_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
                    UIF_TRANSFER = 0;           // Writing 0 clears the interrupt
                    UIF_BUS_RST = 0;            // Clear interrupt flag

                    Endpoint2UploadBusy = 0;
                    Endpoint3UploadBusy = 0;
                    UsbEp2ByteCount = 0;            // USB endpoint 2 (CDC) received length
                    UsbEp3ByteCount = 0;            // USB endpoint 3 (HID) received length

                    /** Misc */
                    Halted = 0;
                    printStr("Reset done!\n");
                    break;

