tillitis/tillitis-key1/hw/usb_interface/ch552_fw/main.c
                case 's':
                    printStr("Endpoint2UploadBusy = ");    printNumU32(Endpoint2UploadBusy);    printStr("\n");
                    printStr("UsbEp2ByteCount = ");        printNumU32(UsbEp2ByteCount);        printStr("\n");
                    printStr("UEP2_CTRL = 0x");            printNumHex(UEP2_CTRL);              printStr("\n");

                    printStr("Endpoint3UploadBusy = ");    printNumU32(Endpoint3UploadBusy);    printStr("\n");
                    printStr("UsbEp3ByteCount = ");        printNumU32(UsbEp3ByteCount);        printStr("\n");
                    printStr("UEP3_CTRL = 0x");            printNumHex(UEP3_CTRL);              printStr("\n");

                    printStr("UartRxBufInputPointer  = "); printNumU32(UartRxBufInputPointer);  printStr("\n");
                    printStr("UartRxBufOutputPointer = "); printNumU32(UartRxBufOutputPointer); printStr("\n");
                    printStr("UartRxBufOverflow = ");      printNumU32(UartRxBufOverflow);      printStr("\n");

                    printStr("UartRxBufByteCount = ");     printNumU32(UartRxBufByteCount);     printStr("\n");
                    printStr("FrameMode = 0x");            printNumHex(FrameMode);              printStr("\n");
                    printStr("FrameLength = ");            printNumU32(FrameLength);            printStr("\n");
                    printStr("FrameStarted = ");           printNumU32(FrameStarted);           printStr("\n");

                    printStr("CdcDataAvailable = ");       printNumU32(CdcDataAvailable);       printStr("\n");
                    printStr("HidDataAvailable = ");       printNumU32(HidDataAvailable);       printStr("\n");

                    printStr("Halted = ");                 printNumU32(Halted);                 printStr("\n");
                    break;

                default:
                    printStr("\n");
                    break;
                }

                // Update out pointer
                DebugUartRxBufOutputPointer = increment_pointer(DebugUartRxBufOutputPointer, DebugUartRxBufByteCount, DEBUG_UART_RX_BUF_SIZE);
            }
#endif
        } /* END if (UsbConfig) */
    } /* END while (1) */
}
